In [57]:
import acquisition
import numpy as np
import pandas as pd

In [58]:
acq = acquisition.Acquisition()
df_users = acq.get_users()
df_users.grav.replace(inplace=True, value=5, to_replace=1) #to have the value in order cause unscathered was after death
df_users.grav = df_users.grav.sub(1) # to be more human-friendly

C:\Users\clemsou\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3357: DtypeWarning: Columns (14) have mixed types.Specify dtype option on import or set low_memory=False.
  if (await self.run_code(code, result,  async_=asy)):
C:\Users\clemsou\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3357: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  if (await self.run_code(code, result,  async_=asy)):

In [59]:

df_users['grav'].describe()

count    1.876005e+06
mean     3.143937e+00
std      8.394679e-01
min      1.000000e+00
25%      3.000000e+00
50%      3.000000e+00
75%      4.000000e+00
max      4.000000e+00
Name: grav, dtype: float64

In [60]:
df_users.drop(inplace=True, labels=["place", "trajet", "locp", "actp", "etatp", "num_veh", "secu"], axis=1)
df_users = df_users.groupby(['Num_Acc'], as_index=False).max() #keeping only the first gave me worst result

In [61]:
df_users.dropna(inplace=True)

In [62]:
df_places = acq.get_places()
df_places.drop(inplace=True, labels=["voie", "v1", "v2", "pr", "pr1", "vosp", "plan", "lartpc", "larrout", "situ", "env1"],axis=1)

In [63]:
df_places.isna().sum()

Num_Acc       0
catr          1
circ        798
nbv        1790
prof       1061
surf       1017
infra      1278
dtype: int64

In [64]:
df_places.dropna(inplace=True)

In [65]:
df_places.circ.unique() #0 should not exist - question from the dataset on kaggle

array([2., 1., 0., 3., 4.])

In [66]:
df_places["circ"] = df_places["circ"].astype(np.int64)
df_places.circ.describe()

count    837362.000000
mean          1.854929
std           0.720794
min           0.000000
25%           2.000000
50%           2.000000
75%           2.000000
max           4.000000
Name: circ, dtype: float64

In [67]:
df_places = df_places[df_places.circ != 0]

In [68]:
df_places.circ.describe()

count    792909.000000
mean          1.958922
std           0.587330
min           1.000000
25%           2.000000
50%           2.000000
75%           2.000000
max           4.000000
Name: circ, dtype: float64

In [69]:
df_places.isna().sum()

Num_Acc    0
catr       0
circ       0
nbv        0
prof       0
surf       0
infra      0
dtype: int64

In [70]:
df_places.head(5)

        Num_Acc  catr  circ  nbv  prof  surf  infra
0  201600000001   3.0     2  0.0   1.0   1.0    0.0
1  201600000002   3.0     1  0.0   1.0   1.0    0.0
2  201600000003   3.0     2  2.0   1.0   2.0    0.0
3  201600000004   4.0     2  0.0   1.0   1.0    0.0
5  201600000006   3.0     2  0.0   1.0   1.0    0.0

In [71]:
df_carac = acq.get_accident_caracteristics()
df_carac.drop(inplace=True, labels=["an",
                                    "col",
                                    "com",
                                    "adr",
                                    "gps",
                                    "lat",
                                    "long"],axis=1)

In [72]:
df_carac.isna().sum()

Num_Acc     0
mois        0
jour        0
hrmn        0
lum         0
agg         0
int         0
atm        21
dep         0
dtype: int64

In [73]:
df_carac.dropna(inplace=True)

In [74]:
df_carac.isna().sum()

Num_Acc    0
mois       0
jour       0
hrmn       0
lum        0
agg        0
int        0
atm        0
dep        0
dtype: int64

In [75]:
df_carac.head(5)

        Num_Acc  mois  jour  hrmn  lum  agg  int  atm  dep
1  201600000002     3    16  1800    1    2    6  1.0  590
2  201600000003     7    13  1900    1    1    1  1.0  590
3  201600000004     8    15  1930    2    2    1  7.0  590
4  201600000005    12    23  1100    1    2    3  1.0  590
5  201600000006    12    23  1115    1    2    1  7.0  590

In [76]:
df_carac['mn'] = df_carac['hrmn'].astype(str).str[-2:]
df_carac['hr'] = df_carac['hrmn'].astype(str).str[:-2]
df_carac.drop(columns='hrmn',inplace=True)

In [77]:
df_carac.head(5)

        Num_Acc  mois  jour  lum  agg  int  atm  dep  mn  hr
1  201600000002     3    16    1    2    6  1.0  590  00  18
2  201600000003     7    13    1    1    1  1.0  590  00  19
3  201600000004     8    15    2    2    1  7.0  590  30  19
4  201600000005    12    23    1    2    3  1.0  590  00  11
5  201600000006    12    23    1    2    1  7.0  590  15  11

In [78]:
df_carac['hr'].unique()

array(['18', '19', '11', '10', '8', '16', '12', '7', '20', '15', '9', '5',
       '13', '17', '21', '3', '6', '14', '22', '2', '1', '4', '23', ''],
      dtype=object)

In [79]:
df_carac['hr'].replace(inplace=True, to_replace='', value='0')

In [80]:
df_carac['hr'].unique()

array(['18', '19', '11', '10', '8', '16', '12', '7', '20', '15', '9', '5',
       '13', '17', '21', '3', '6', '14', '22', '2', '1', '4', '23', '0'],
      dtype=object)

In [81]:
df_users.dtypes

Num_Acc      int64
catu         int64
grav         int64
sexe         int64
an_nais    float64
dtype: object

In [82]:
df_users.an_nais = df_users.an_nais.astype((np.int64))

In [83]:
df_users.dtypes

Num_Acc    int64
catu       int64
grav       int64
sexe       int64
an_nais    int64
dtype: object

In [84]:
df_carac.dtypes

Num_Acc      int64
mois         int64
jour         int64
lum          int64
agg          int64
int          int64
atm        float64
dep          int64
mn          object
hr          object
dtype: object

In [85]:
df_carac[['atm', 'mn', 'hr']] = df_carac[['atm', 'mn', 'hr']].astype((np.int64))

In [86]:
df_carac.dtypes

Num_Acc    int64
mois       int64
jour       int64
lum        int64
agg        int64
int        int64
atm        int64
dep        int64
mn         int64
hr         int64
dtype: object

In [87]:
df_places.dtypes

Num_Acc      int64
catr       float64
circ         int64
nbv        float64
prof       float64
surf       float64
infra      float64
dtype: object

In [88]:
df_places.columns

Index(['Num_Acc', 'catr', 'circ', 'nbv', 'prof', 'surf', 'infra'], dtype='object')

In [89]:
df_places[df_places.columns] = df_places[df_places.columns].astype((np.int64))

In [90]:
df_places.dtypes

Num_Acc    int64
catr       int64
circ       int64
nbv        int64
prof       int64
surf       int64
infra      int64
dtype: object

In [91]:
df_users.head(15)

         Num_Acc  catu  grav  sexe  an_nais
0   200500000001     2     4     2     2004
1   200500000002     1     4     1     1979
2   200500000003     1     4     1     1983
3   200500000004     2     3     2     1972
4   200500000005     2     3     1     1990
5   200500000006     1     1     2     1951
6   200500000007     1     4     2     1983
7   200500000008     1     2     1     1978
8   200500000009     2     3     2     1966
9   200500000010     3     4     1     1962
10  200500000011     2     4     2     1986
11  200500000012     1     3     1     1986
12  200500000013     1     3     2     1971
13  200500000014     3     4     2     1987
14  200500000015     3     2     2     1938

In [92]:
df_carac.head(15)

         Num_Acc  mois  jour  lum  agg  int  atm  dep  mn  hr
1   201600000002     3    16    1    2    6    1  590   0  18
2   201600000003     7    13    1    1    1    1  590   0  19
3   201600000004     8    15    2    2    1    7  590  30  19
4   201600000005    12    23    1    2    3    1  590   0  11
5   201600000006    12    23    1    2    1    7  590  15  11
6   201600000007     5     1    1    2    1    7  590  45  11
7   201600000008     5    14    2    1    1    1  590  15  19
8   201600000009     9    23    1    2    1    1  590   0  19
9   201600000010    12    30    1    1    1    9  590  30  10
10  201600000011     1    25    2    2    1    8  590   0   8
11  201600000012     1    28    3    1    1    1  590  15  18
12  201600000013     2     5    1    2    1    1  590   0  16
13  201600000014     4    17    1    2    1    1  590  30  12
14  201600000015     8    17    1    1    6    7  590  30  19
15  201600000016     9     8    1    1    1    1  590  15   8

In [93]:
print(len(df_users.Num_Acc.unique().tolist()))
print(df_users.shape[0])

839509
839509

In [94]:
print(len(df_places.Num_Acc.unique().tolist()))
print(df_places.shape[0])

792909
792909

In [95]:
print(len(df_carac.Num_Acc.unique().tolist()))
print(df_carac.shape[0])

362445
362445

In [96]:
df_users = df_users.reset_index(drop=True)
df_carac = df_carac.reset_index(drop=True)
df_places = df_places.reset_index(drop=True)
df_x_y = df_carac.merge(df_places, on="Num_Acc")
df_x_y = df_x_y.merge(df_users, on="Num_Acc")

In [97]:
df_x_y.head(15)

,Num_Acc,mois,jour,lum,agg,int,atm,dep,mn,hr,catr,circ,nbv,prof,surf,infra,catu,grav,sexe,an_nais
0,201600000002,3,16,1,2,6,1,590,0,18,3,1,0,1,1,0,2,2,2,2000
1,201600000003,7,13,1,1,1,1,590,0,19,3,2,2,1,2,0,3,4,1,1997
2,201600000004,8,15,2,2,1,7,590,30,19,4,2,0,1,1,0,2,4,2,1999
3,201600000006,12,23,1,2,1,7,590,15,11,3,2,0,1,1,0,3,4,2,1978
4,201600000007,5,1,1,2,1,7,590,45,11,3,2,0,1,1,0,2,4,1,2001
5,201600000008,5,14,2,1,1,1,590,15,19,3,2,2,1,1,0,2,4,2,1975
6,201600000009,9,23,1,2,1,1,590,0,19,4,2,2,1,1,0,1,4,1,2001
7,201600000010,12,30,1,1,1,9,590,30,10,4,2,0,0,7,0,3,4,1,1973
8,201600000011,1,25,2,2,1,8,590,0,8,3,2,2,1,2,0,3,4,2,1966
9,201600000012,1,28,3,1,1,1,590,15,18,3,2,2,0,1,0,1,2,1,1990
10,201600000013,2,5,1,2,1,1,590,0,16,3,2,0,0,0,0,3,4,2,1947
11,201600000014,4,17,1,2,1,1,590,30,12,3,2,2,0,1,0,1,4,1,1996
12,201600000015,8,17,1,1,6,7,590,30,19,3,1,1,1,1,5,1,4,1,1992
13,201600000016,9,8,1,1,1,1,590,15,8,4,2,2,1,1,0,1,4,2,1994
14,201600000017,11,8,3,1,1,8,590,15,7,3,2,0,1,6,0,1,2,2,1996

In [98]:
df_x_y.shape[0]

340687

In [99]:
df_x_y.isna().sum()

Num_Acc    0
mois       0
jour       0
lum        0
agg        0
int        0
atm        0
dep        0
mn         0
hr         0
catr       0
circ       0
nbv        0
prof       0
surf       0
infra      0
catu       0
grav       0
sexe       0
an_nais    0
dtype: int64

In [100]:
df_x_y.dropna(inplace=True)

In [101]:
df_x_y.drop('Num_Acc', axis=1,inplace=True)

In [102]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import classification_report
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import RepeatedStratifiedKFold, StratifiedKFold
from sklearn.metrics import accuracy_score, confusion_matrix, roc_curve, roc_auc_score, precision_score, recall_score, precision_recall_curve, f1_score
from sklearn.utils import class_weight

In [103]:
df_x_y.grav.value_counts() #stratifiedKfold

4    217623
2     57893
3     54558
1     10613
Name: grav, dtype: int64

In [104]:
cv = RepeatedStratifiedKFold()
#cross_val_score(KNeighborsClassifier(), X=df_x_y.drop('grav', axis=1), y=df_x_y['grav'], cv=cv)
X = df_x_y.drop('grav', axis=1)
y = df_x_y['grav']

In [106]:
# train-test split
X_train, X_test, y_train, y_test = train_test_split(
    X, y, test_size=0.2, random_state=0, stratify=y)
labels=['mort', 'hopital', 'blesse','sauf']

In [107]:
class_weights = class_weight.compute_class_weight(class_weight='balanced',
                                                  classes=np.unique(y_train),
                                                  y=y_train)
class_weights = dict(zip(range(1, len(class_weights) + 1), class_weights))

In [108]:
scaler = StandardScaler()
scaler.fit(X_train)
X_train = scaler.transform(X_train)
X_test = scaler.transform(X_test)

In [109]:

model = LogisticRegression(
    max_iter=1000, class_weight=class_weights, penalty='l2', solver='liblinear', C=0.5)
#grid = GridSearchCV(model, hyperparam_grid, cv=cv, scoring='f1_macro')
#cv_model = cross_val_score(model,X,y,cv=cv, scoring='f1_macro')
#grid.fit(X_train, y_train)
#print(grid.best_score_)
#print(grid.best_params_)
#print(cv_model)
model.fit(X_train, y_train)
y_pred = model.predict(X_test)

In [110]:
print(classification_report(y_test, y_pred))
score = f1_score(y_test, y_pred, average='macro')
print('Accuracy :', score)

              precision    recall  f1-score   support

           1       0.14      0.38      0.20      2122
           2       0.33      0.39      0.35     11579
           3       0.26      0.02      0.03     10912
           4       0.75      0.82      0.78     43525

    accuracy                           0.60     68138
   macro avg       0.37      0.40      0.34     68138
weighted avg       0.58      0.60      0.57     68138

Accuracy : 0.34326984029783497

In [111]:
import pickle
filename = 'finalized_model.sav'
pickle.dump(model, open(filename, 'wb'))
loaded_model = pickle.load(open(filename, 'rb'))